>>SOURCE FORMAT FREE
IDENTIFICATION DIVISION.
PROGRAM-ID. PAYCLR.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 INPUT-LINE PIC X(512).
01 RESERVATION-PRESENT PIC X.
01 CLEARING-PRESENT PIC X.
01 RESERVATION-MATCH PIC X.
PROCEDURE DIVISION.
MAIN.
    ACCEPT INPUT-LINE
    DISPLAY "CREATE_CLEARING"
    STOP RUN.
